# 编写一个程序完成以下功能

## 1.设计两个函数分别完成一些功能：

### (1) String or Bool longestString(Array arr) 要求返回列表arr中字符串长度最长的字符串，其他情况则返回0

### (2) Array divideString(String str, Char c) 要求将输入的字符串str按照字符c将字符串分割，若字符串中不存在c字符，则把原字符串储存在数组中返回

## 2.设计主程序:

### 阶段A(开始):

#### (1) 用户可以多次输入单条字符串，直到用户输入"next"时，程序进入阶段B。

#### (2) 用户每输入一次字符串，就打印一次所有已输入的字符串中长度最长的字符串以及它的长度。

### 阶段B:

#### (1) 用户可以多次输入单条字符串，当用户输入"last"时，程序返回阶段A；当用户输入"next"时，程序进入阶段C。

#### (2) 用户每输入一次字符串，若字符串长度不等于1，则提示用户输入长度为1的字符串(输入"last"和"next"时不需要提示)。
####     反之，将阶段A中长度最长的字符串按照输入的字符进行分割，且将分割好的数组打印在屏幕上

### 阶段C:

#### (1) 用户可以哔————————————(想不到了)要不结束程序吧


# 附加题:

## 数组数据如下，类excel:
arr = [
    ["姓名", "学号", "平时成绩", "期末成绩", "是否通过", "总评成绩", "加分成绩"],
    ["小明", "3021001778", 30, 60, False, 0, 0],
    ["小红", "3021661290", 56, 71, False, 0, 0],
    ["小李", "3021002810", 21, 30, False, 0, 0],
    ["小张", "3021661241", 10, 10, False, 0, 0],
    ["小邓", "3021001779", 12, 20, False, 0, 0],
    ["阿明", "3021001231", 29, 21, False, 0, 0],
    ["阿红", "3020661929", 20, 40, False, 0, 0]
]

# 一键捞人程序

## 已知总评60分才能及格，平时成绩占比20%，期末成绩占比80%，且成绩均为整数，小于等于100，大于等于0

## 学号中从第五位开始，到第七位为661的，为少数民族学生。
## 若少数民族学生要挂科了，总评成绩可以添加10分；添加10分后不挂科了，总评成绩按60分算。

for index in range(1, len(arr)):
    end_grade = arr[index][2] * 0.2 + arr[index][3] * 0.8

    if end_grade < 60:
        while arr[index][2] < 100 and end_grade < 60:
            arr[index][2] += 1
            end_grade = arr[index][2] * 0.2 + arr[index][3] * 0.8

    if arr[index][1][4:7] == "661" and end_grade < 60:
        new_grade = 10 + end_grade
        if new_grade >= 60:
            end_grade = 60
            arr[index][6] = 70 - new_grade

    if end_grade >= 60: arr[index][4] = True

    arr[index][5] = end_grade

for x in arr:
    for y in x:
        print(y, end=" ")
    print("")
            
